### 3.6.4. USING

###### USING은 쿼리 실행 계획을 수립 할 때 플래너의 결정에 영향을 미칩니다.

강제 플래너 동작은 고급 기능이므로 쿼리가 제대로 수행되지 않을 수 있으므로 숙련된 개발자 및 / 또는 데이터베이스 관리자만 주의해서 사용해야 합니다.

#### 3.6.4.1. 소개

쿼리를 실행할 때, Neo4j는 쿼리 그래프에서 일치를 시작할 위치를 결정해야 합니다. 이것은 ```MATCH``` 및 ```WHERE``` 조건을 보고 유용한 인덱스 또는 다른 시작점을 찾기 위해 해당정보를 사용하여 수행됩니다.

그러나 선택한 색인이 항상 최상의 선택이 아닐 수도 있습니다. 때때로 여러 인덱스가 후보가 될 수 있으며 쿼리 계획자는 성능 관점에서 잘못된 인덱스를 선택합니다. 그리고 어떤 경우에는 (드물긴 하지만) 색인을 사용하지 않는 것이 좋습니다.

Neo4j가 ```USING```을 통해 특정 시작점을 사용하게 할 수 있습니다. 이것을 플래터 힌트라고 합니다. 플래너 힌트에는 인덱스 힌트, 검색 힌트 및 조인 힌트의 세 가지 유형이 있습니다.

쿼리에 ```START```가 있으면 플래너 힌트를 사용할 수 없습니다.
다음 그래프는 아래의 예제에서 사용됩니다.

**Figure 3.23. Graph**

**Query.**
```Javascript
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
RETURN 1 AS column
```
이 페이지의 일부 예제에서는 다음 쿼리가 사용됩니다. 이것은 의도적으로 통계 정보가 이 쿼리와 일치하는 특정 부분 그래프에 대해 부정확 할 수 있는 방식으로 생성되었습니다. 이러한 이유 때문에 플래너 힌트를 제공하여 향상시킬 수 있습니다.

**Query plan.**
```
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables                                                         | Other                                                                              |
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +ProduceResults |              0 |    1 |       0 | column                                                            | column                                                                             |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Projection     |              0 |    1 |       0 | column -- anon[122], anon[41], anon[68], conway, cs, liskov, wing | {column : {  AUTOINT3}}                                                            |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       3 | anon[122], anon[41], anon[68], conway, cs, liskov, wing           | NOT(anon[122] == anon[68]) AND conway.name == {  AUTOSTRING2} AND conway:Scientist |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    3 |       4 | anon[122], conway -- anon[41], anon[68], cs, liskov, wing         | (cs)<-[:RESEARCHED]-(conway)                                                       |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       4 | anon[41], anon[68], cs, liskov, wing                              | cs:Science AND cs.name == {  AUTOSTRING1}                                          |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    2 |       3 | anon[68], cs -- anon[41], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)                                                         |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       1 | anon[41], liskov, wing                                            | wing:Scientist                                                                     |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    1 |       2 | anon[41], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                                                          |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 | liskov                                                            | :Scientist(name)                                                                   |
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+

Total database accesses: 19
```
#### 3.6.4.2. 인덱스 힌트

인덱스 힌트는 플래너가 시작지점으로 사용할 인덱스를 지정하는데 사용됩니다. 이는 인덱스가 사용중인 것으로 알려진 특정 값에 대해 인덱스 통계가 정확하지 않은 경우에 유용 할 수 있으며 이로 인해 플래너가 최적이 아닌 인덱스를 선택하게 됩니다. 인덱스 힌트를 제공하려면 ```MATCH```절 뒤에 ```USING INDEX variable:Label(property)```를 사용하시기 바랍니다.

여러 가지 인덱스 힌트를 제공 할 수도 있지만 몇 가지 시작 지점에서는 나중에 쿼리 계획에서 잠재적으로 값 비싼 조인을 사용해야 합니다.

**인덱스 힌트를 사용한 쿼리**

위의 쿼리는 계획을 해결하기 위해 인덱스를 자동으로 선택하지 않습니다. 이는 그래프가 매우 작기 때문에 작은 데이터베이스에서 레이블 스캔이 더 빠르기 때문입니다. 그러나 일반적으로 쿼리 성능은 dbhit 메트릭에 의해 순위가 매겨지며 인덱스를 사용하면 이 쿼리에 대해 약간 더 좋습니다.

**Query.**
```Javascript
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
RETURN liskov.born AS column
```
**'Barbara Liskov'**가 태어난 년도를 반환합니다.

**Query plan.**
```
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables                                                         | Other                                                                              |
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +ProduceResults |              0 |    1 |       0 | column                                                            | column                                                                             |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Projection     |              0 |    1 |       1 | column -- anon[122], anon[41], anon[68], conway, cs, liskov, wing | {column : liskov.born}                                                             |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       3 | anon[122], anon[41], anon[68], conway, cs, liskov, wing           | NOT(anon[122] == anon[68]) AND conway.name == {  AUTOSTRING2} AND conway:Scientist |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    3 |       4 | anon[122], conway -- anon[41], anon[68], cs, liskov, wing         | (cs)<-[:RESEARCHED]-(conway)                                                       |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       4 | anon[41], anon[68], cs, liskov, wing                              | cs:Science AND cs.name == {  AUTOSTRING1}                                          |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    2 |       3 | anon[68], cs -- anon[41], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)                                                         |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       1 | anon[41], liskov, wing                                            | wing:Scientist                                                                     |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    1 |       2 | anon[41], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                                                          |
| |               +----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 | liskov                                                            | :Scientist(name)                                                                   |
+-----------------+----------------+------+---------+-------------------------------------------------------------------+------------------------------------------------------------------------------------+

Total database accesses: 20
```
**여러 인덱스 힌트를 사용한 쿼리**

하나의 인덱스 힌트를 제공하면 쿼리의 시작점이 변경되었지만, 계획은 여전히 ​​선형이므로 시작 지점이 하나뿐입니다. 플래너에게 또 다른 인덱스 힌트를 주면 우리는 두 개의 시작점 (매치의 양쪽 끝에 하나씩)을 사용하도록 강요합니다. 그런 다음 조인 연산자를 사용하여 이 두 가지를 결합합니다.

**Query.**
```Javascript
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
RETURN liskov.born AS column
```

좀 더 나은 계획을 사용하여, **'Barbara Liskov'**가 태어난 해를 반환합니다.

**Query plan.**
```
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                                                         | Other                                     |
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +ProduceResults  |              0 |    1 |       0 | column                                                            | column                                    |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Projection      |              0 |    1 |       1 | column -- anon[122], anon[41], anon[68], conway, cs, liskov, wing | {column : liskov.born}                    |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Filter          |              0 |    1 |       0 | anon[122], anon[41], anon[68], conway, cs, liskov, wing           | NOT(anon[122] == anon[68])                |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +NodeHashJoin    |              0 |    1 |       0 | anon[41], anon[68], liskov, wing -- anon[122], conway, cs         | cs                                        |
| |\               +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Filter        |              1 |    1 |       1 | anon[122], conway, cs                                             | cs.name == {  AUTOSTRING1}                |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Expand(All)   |              1 |    1 |       2 | anon[122], cs -- conway                                           | (conway)-[:RESEARCHED]->(cs)              |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +NodeIndexSeek |              1 |    1 |       2 | conway                                                            | :Scientist(name)                          |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Filter          |              0 |    1 |       4 | anon[41], anon[68], cs, liskov, wing                              | cs:Science AND cs.name == {  AUTOSTRING1} |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Expand(All)     |              0 |    2 |       3 | anon[68], cs -- anon[41], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)                |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Filter          |              0 |    1 |       1 | anon[41], liskov, wing                                            | wing:Scientist                            |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Expand(All)     |              0 |    1 |       2 | anon[41], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                 |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +NodeIndexSeek   |              1 |    1 |       2 | liskov                                                            | :Scientist(name)                          |
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+

Total database accesses: 18
```
#### 3.6.4.3. 스캔 힌트

쿼리가 인덱스의 큰 부분과 일치하면 레이블을 스캔하고 일치하지 않는 노드를 필터링하는 것이 더 빠릅니다. 이렇게 하려면 ```USING SCAN variable:Label```을 해당 ```MATCH``` 다음에 사용할 수 있습니다. 이렇게 하면 Cypher는 사용되었을 수 있는 색인을 사용하지 않고 대신 레이블 스캔을 수행합니다.

**레이블 스캔 힌트**

레이블의 모든 노드를 스캔 한 다음 해당 집합을 필터링하여 최상의 성능을 얻으려면 USING SCAN을 사용하십시오.

**Query.**
```Javascript
MATCH (s:Scientist)
USING SCAN s:Scientist
WHERE s.born < 1939
RETURN s.born AS column
Returns all scientists born before '1939'.
```
**Query plan.**
```
+------------------+----------------+------+---------+-------------+-------------------------------------------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables   | Other                                                             |
+------------------+----------------+------+---------+-------------+-------------------------------------------------------------------+
| +ProduceResults  |              0 |    2 |       0 | column      | column                                                            |
| |                +----------------+------+---------+-------------+-------------------------------------------------------------------+
| +Projection      |              0 |    2 |       2 | column -- s | {column : s.born}                                                 |
| |                +----------------+------+---------+-------------+-------------------------------------------------------------------+
| +Filter          |              0 |    2 |       7 | s           | AndedPropertyComparablePredicates(s,s.born,s.born < {  AUTOINT0}) |
| |                +----------------+------+---------+-------------+-------------------------------------------------------------------+
| +NodeByLabelScan |              7 |    7 |       8 | s           | :Scientist                                                        |
+------------------+----------------+------+---------+-------------+-------------------------------------------------------------------+

Total database accesses: 17
```
#### 3.6.4.4. 조인 힌트

조인 힌트는 가장 진보된 유형의 힌트이며, 쿼리 실행 계획의 시작 지점을 찾는 데 사용되지는 않지만 지정된 지점에서 조인이 수행되도록 적용됩니다. 이는 쿼리가 이 leaves에서 오름차순으로 두 지점에 합류 할 수 있도록 계획에 두 개 이상의 시작점 (리프)이 포함되어 있어야 함을 의미합니다. 이러한 특성으로 인해 조인과 이후의 조인힌트를 결합하면 플래너가 추가 시작점을 찾도록 계획자에게 강요하며, 더 이상 좋은 시작점이 없는 경우에는 잠재적으로 매우 나쁜 출발점을 선택하게 됩니다. 이는 쿼리 성능에 부정적인 영향을 미칩니다. 다른 경우에, 힌트는 플래너가 겉보기에 나쁜 시작점을 선택하도록 강제 할 수 있으며 실제로는 아주 좋은 것으로 입증됩니다.

**단일 노드에서 조인 힌트**

위의 예제에서 다중 인덱스 힌트를 사용하여, 계획자가 cs 노드에서 조인을 선택했습니다. 이는 ```wing```와 ```cs``` 사이의 관계가 나가는 방향으로 지나갔다는 것을 의미합니다. 즉, 패턴 ```()-[:RESEARCHED]→(:Science)```가 패턴 ```(:Scientist)-[:RESEARCHED]→()```보다 일반적이기 때문에 통계적으로 더 좋습니다. 그러나 실제 그래프에서 cs 노드에는 두 개의 관계만 있으므로 날개 노드에서 확장하면 날개 노드에 도움이 될 것입니다. 조인 힌트를 사용하여 조인을 강제로 수행 할 수 있습니다.

**Query.**
```Javascript
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
USING JOIN ON wing
RETURN wing.born AS column
```
약간 더 나은 계획을 사용하여 **'Jeanette Wing'**의 생일을 반환합니다.

**Query plan.**
```
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                                                         | Other                                     |
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +ProduceResults  |              0 |    1 |       0 | column                                                            | column                                    |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Projection      |              0 |    1 |       1 | column -- anon[122], anon[41], anon[68], conway, cs, liskov, wing | {column : wing.born}                      |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +NodeHashJoin    |              0 |    1 |       0 | anon[41], liskov -- anon[122], anon[68], conway, cs, wing         | wing                                      |
| |\               +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Filter        |              1 |    2 |       0 | anon[122], anon[68], conway, cs, wing                             | NOT(anon[122] == anon[68])                |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Expand(All)   |              1 |    3 |       4 | anon[68], wing -- anon[122], conway, cs                           | (cs)<-[:RESEARCHED]-(wing)                |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Filter        |              0 |    1 |       2 | anon[122], conway, cs                                             | cs:Science AND cs.name == {  AUTOSTRING1} |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +Expand(All)   |              1 |    1 |       2 | anon[122], cs -- conway                                           | (conway)-[:RESEARCHED]->(cs)              |
| | |              +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| | +NodeIndexSeek |              1 |    1 |       2 | conway                                                            | :Scientist(name)                          |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Filter          |              0 |    1 |       1 | anon[41], liskov, wing                                            | wing:Scientist                            |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +Expand(All)     |              0 |    1 |       2 | anon[41], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                 |
| |                +----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+
| +NodeIndexSeek   |              1 |    1 |       2 | liskov                                                            | :Scientist(name)                          |
+------------------+----------------+------+---------+-------------------------------------------------------------------+-------------------------------------------+

Total database accesses: 16
```

**멀티노드에서 대한 조인 힌트**

쿼리 계획자는 여러 특정 지점 간의 조인을 생성 할 수 있습니다. 이를 위해서는 같은 노드에서 쿼리를 여러 방향으로 확장해야 합니다.

**Query.**
```Javascript
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist { name:'Wing' })-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(liskov)
USING INDEX liskov:Scientist(name)
USING JOIN ON liskov, cs
RETURN wing.born AS column
```
**'Jeanette Wing'.**의 생일을 반환합니다.

**Query plan.**
```
+------------------+----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                                                 | Other                                           |
+------------------+----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +ProduceResults  |              0 |    1 |       0 | column                                                    | column                                          |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Projection      |              0 |    1 |       1 | column -- anon[136], anon[41], anon[82], cs, liskov, wing | {column : wing.born}                            |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Filter          |              0 |    1 |       0 | anon[136], anon[41], anon[82], cs, liskov, wing           | NOT(anon[136] == anon[82])                      |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +NodeHashJoin    |              0 |    1 |       0 | anon[41], anon[82], wing -- anon[136], cs, liskov         | liskov, cs                                      |
| |\               +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| | +Filter        |              1 |    1 |       2 | anon[136], cs, liskov                                     | cs:Science AND cs.name == {  AUTOSTRING2}       |
| | |              +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| | +Expand(All)   |              1 |    1 |       2 | anon[136], cs -- liskov                                   | (liskov)-[:RESEARCHED]->(cs)                    |
| | |              +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| | +NodeIndexSeek |              1 |    1 |       2 | liskov                                                    | :Scientist(name)                                |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Filter          |              0 |    1 |       4 | anon[41], anon[82], cs, liskov, wing                      | cs:Science AND cs.name == {  AUTOSTRING2}       |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Expand(All)     |              0 |    2 |       3 | anon[82], cs -- anon[41], liskov, wing                    | (wing)-[:RESEARCHED]->(cs)                      |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Filter          |              0 |    1 |       2 | anon[41], liskov, wing                                    | wing:Scientist AND wing.name == {  AUTOSTRING1} |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +Expand(All)     |              0 |    1 |       2 | anon[41], wing -- liskov                                  | (liskov)-[:KNOWS]->(wing)                       |
| |                +----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+
| +NodeIndexSeek   |              1 |    1 |       2 | liskov                                                    | :Scientist(name)                                |
+------------------+----------------+------+---------+-----------------------------------------------------------+-------------------------------------------------+

Total database accesses: 20
```
