### 3.2.8. 리스트 (Lists)

Cypher는 리스트를 잘 지원합니다.

#### 3.2.8.1. 일반적인 리스트

리터럴 리스트는 대괄호를 사용하고 목록의 요소를 쉼표로 분리하여 만듭니다.

**쿼리**
```Javascript
RETURN [0, 1, 2, 3, 4, 5, 6, 7, 8, 9] AS list
```

**결과**
```
+-----------------------+
| list                  |
+-----------------------+
| [0,1,2,3,4,5,6,7,8,9] |
+-----------------------+
1 row
```

예제에서는 범위 함수를 사용합니다. 주어진 시작 번호와 끝 번호 사이의 모든 숫자를 포함하는 목록을 제공합니다. 범위는 양쪽 끝을 포함합니다.

목록의 개별 요소에 액세스하려면 대괄호를 다시 사용합니다. 이렇게 하면 시작 색인에서 끝 색인까지 포함되지만 끝 색인은 제외됩니다.

**쿼리**
```Javascript
RETURN range(0, 10)[3]
```
**결과**
```
+-----------------+
| range(0, 10)[3] |
+-----------------+
| 3               |
+-----------------+
1 row
```

음수를 사용하여 목록의 끝에서부터 시작할 수도 있습니다.


**쿼리**
```Javascript
RETURN range(0, 10)[-3]
```
**결과**
```
+------------------+
| range(0, 10)[-3] |
+------------------+
| 8                |
+------------------+
1 row
```
마지막으로 대괄호 안의 범위를 사용하여 목록의 범위를 반환 할 수 있습니다.

**쿼리**
```Javascript
RETURN range(0, 10)[0..3]
```

**결과**
```
+--------------------+
| range(0, 10)[0..3] |
+--------------------+
| [0,1,2]            |
+--------------------+
1 row
```
**쿼리**
```Javascript
RETURN range(0, 10)[0..-5]
```
**결과**
```
+---------------------+
| range(0, 10)[0..-5] |
+---------------------+
| [0,1,2,3,4,5]       |
+---------------------+
1 row
```
**쿼리**
```Javascript
RETURN range(0, 10)[-5..]
```
**결과**
```
+--------------------+
| range(0, 10)[-5..] |
+--------------------+
| [6,7,8,9,10]       |
+--------------------+
1 row
```
**쿼리**
```Javascript
RETURN range(0, 10)[..4]
```
**결과**
```
+-------------------+
| range(0, 10)[..4] |
+-------------------+
| [0,1,2,3]         |
+-------------------+
1 row
```
<table width=1200><tr><td><i class="fa icon-alert-circle" title="important"></i></td><td width=90%>범위를 벗어나는 슬라이스는 단순히 잘리지 만 바인딩되지 않은 단일 요소는 `null` 반환합니다.
</td></tr><table>

**쿼리**
```Javascript
RETURN range(0, 10)[15]
```
**결과**
```
+------------------+
| range(0, 10)[15] |
+------------------+
| <null>           |
+------------------+
1 row
```
**쿼리**
```Javascript
RETURN range(0, 10)[5..15]
```
**결과**
```
+---------------------+
| range(0, 10)[5..15] |
+---------------------+
| [5,6,7,8,9,10]      |
+---------------------+
1 row
```

다음과 같이 목록 크기를 얻을 수 있습니다.

**쿼리**
```Javascript
RETURN size(range(0, 10)[0..3])
```
**결과**
```
+--------------------------+
| size(range(0, 10)[0..3]) |
+--------------------------+
| 3                        |
+--------------------------+
1 row
```

#### 3.2.8.2. 리스트 컴프리헨션(List comprehension)

리스트컴프리헨션은 기존 리스트를 기반으로 리스트를 작성하기 위해 Cypher에서 사용할 수있는 구문 구조입니다. 그것은 맵과 필터 함수를 사용하는 대신에 수학적인 set-builder 표기법(set comprehension)의 형태를 따른다.

**쿼리**
```Javascript
RETURN [x IN range(0,10) WHERE x % 2 = 0 | x^3] AS result
```
**결과**
```
+-----------------------------------+
| result                            |
+-----------------------------------+
| [0.0,8.0,64.0,216.0,512.0,1000.0] |
+-----------------------------------+
1 row
```

필터하거나 맵핑하려는 경우 `WHERE` 부분 또는 표현식을 생략 할 수 있습니다.


**쿼리**
```Javascript
RETURN [x IN range(0,10) WHERE x % 2 = 0] AS result
```
**결과**
```
+----------------+
| result         |
+----------------+
| [0,2,4,6,8,10] |
+----------------+
1 row
```
**쿼리**
```Javascript
RETURN [x IN range(0,10)| x^3] AS result
```
**결과**
```
+--------------------------------------------------------------+
| result                                                       |
+--------------------------------------------------------------+
| [0.0,1.0,8.0,27.0,64.0,125.0,216.0,343.0,512.0,729.0,1000.0] |
+--------------------------------------------------------------+
1 row
```

#### 3.2.8.3. 패턴 컴프리헨션 (Pattern comprehension)

패턴 컴프리헨션은 패턴 매치를 기반으로 한 리스트를 만들기 위해 Cypher에서 사용할 수 있는 구조입니다.패턴 이해는 일반 `WHERE` 절과 같은 술어와 함께 일반 `MATCH` 절과 같이 지정된 패턴과 일치하지만 지정된대로 사용자 정의 투영을 산출합니다.


**쿼리**
```Javascript
MATCH (a:Person { name: 'Charlie Sheen' })
RETURN [(a)-->(b) WHERE b:Movie | b.year] AS years
```
**결과**
```
+------------------+
| years            |
+------------------+
| [1979,1984,1987] |
+------------------+
1 row
```
`WHERE` 키워드를 포함한 전체 술어는 선택적이며 생략 될 수 있습니다.


#### 3.2.8.4. 리터럴 맵스 (Literal maps)

Cypher에서 맵을 만들 수 있습니다. REST를 통해서 JSON 객체를 얻을 수 있습니다. Java에서는 `java.util.Map<String,Object>`이 사용됩니다.

**쿼리**
```Javascript
RETURN { key: 'Value', listKey: [{ inner: 'Map1' }, { inner: 'Map2' }]}
```
**결과**
```
+--------------------------------------------------------------------+
| {key: 'Value', listKey: [{inner: 'Map1'}, {inner: 'Map2'}]}        |
+--------------------------------------------------------------------+
| {key -> "Value", listKey -> [{inner -> "Map1"},{inner -> "Map2"}]} |
+--------------------------------------------------------------------+
1 row
```

#### 3.2.8.5. 지도 투영법 (Map Projection)

Cypher는 "지도 투영법"이라는 개념을 지원합니다. 노드, 관계 및 다른 지도 값에서도 지도 투영을 쉽게 구성 할 수 있습니다.

지도 투영은 투영 될 그래프 엔티티에 바인딩 된 변수로 시작하고 `{` 및 `}` 로 묶인 쉼표로 구분 된지도 요소의 본문을 포함합니다.
```
map_variable {map_element, [, …​n]}
```
map 요소는 하나 이상의 키 값 쌍을지도 투영에 투영합니다. 네 가지 유형의지도 투영 요소가 있습니다.
- 속성 선택기 - 속성 이름을 키로 투영하며, 값이 반영된 `map_variable` 의 값입니다.
- 리터럴 입력 - 값이 임의의 표현식 `key: <expression>` 인 키 값 쌍입니다.
- 변수 선택기 - 변수 이름을 키로 사용하여 변수를 투영하고 변수가 투영 값으로 가리키는 값을 지정합니다. 구문은 변수 일뿐입니다.
- 모든 속성 선택기 - `map_variable` 값에서 모든 키 값 쌍을 반영합니다.

`map_variable` 이 null 값을 가리키면 전체 지도 투영은 null로 평가됩니다.


지도 투영의 예


Charlie Sheen을 찾아서 자신과 그가 작업 한 영화에 대한 데이터를 반환합니다.이 예는 집합 적 collect() 내에서 지도 투영법을 사용하는 문자 입력과 함께 지도 투영의 예를 보여줍니다.

**쿼리**
```Javascript
MATCH (actor:Person { name: 'Charlie Sheen' })-[:ACTED_IN]->(movie:Movie)
RETURN actor { .name, .realName, movies: collect(movie { .title, .year })}
```
**결과**
```
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| actor                                                                                                                                                                                           |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| {name -> "Charlie Sheen", realName -> "Carlos Irwin Estévez", movies -> [{title -> "Apocalypse Now", year -> 1979},{title -> "Red Dawn", year -> 1984},{title -> "Wall Street", year -> 1987}]} |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row
```
영화에 출연 한 모든 사람을 찾아 각각에 대한 번호를 표시하십시오. 이 예제는 count와 함께 변수를 소개하고, 변수 selector를 사용하여 값을 투영합니다.

**쿼리**
```Javascript
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)
WITH actor, count(movie) AS nrOfMovies
RETURN actor { .name, nrOfMovies }
```
**결과**
```
+--------------------------------------------+
| actor                                      |
+--------------------------------------------+
| {name -> "Charlie Sheen", nrOfMovies -> 3} |
| {name -> "Martin Sheen", nrOfMovies -> 2}  |
+--------------------------------------------+
2 rows
```

다시 말하면, 'Charlie Sheen' 에 초점을 두어 이번에는 노드에서 모든 속성을 반환합니다. 여기서는 모든 노드 속성을 투영하기 위해 모든 속성 선택기를 사용하고 명시 적으로 속성 `age`를 투영합니다. 이 등록 정보는 노드에 없으므로 null 값이 대신 투사됩니다.


**쿼리**
```Javascript
MATCH (actor:Person { name: 'Charlie Sheen' })
RETURN actor { .*, .age }
```
**결과**
```
+------------------------------------------------------------------------------+
| actor                                                                        |
+------------------------------------------------------------------------------+
| {realName -> "Carlos Irwin Estévez", name -> "Charlie Sheen", age -> <null>} |
+------------------------------------------------------------------------------+
1 row
```
