### 3.7.2. 연산자 확장

이 연산자는 그래프 패턴을 확장하여 그래프를 탐색합니다.

#### 3.7.2.1. 전체 확장

시작 노드가 주어지면 expand-all은 패턴 관계에 따라 들어오고 나가는 관계를 따릅니다. 가변 길이 패턴 관계도 처리할 수 ​​있습니다.

**Query.**
```Javascript
MATCH (p:Person { name: 'me' })-[:FRIENDS_WITH]->(fof)
RETURN fof
```
**Query Plan.**

```
+-----------------+----------------+------+---------+--------------------+----------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables          | Other                      |
+-----------------+----------------+------+---------+--------------------+----------------------------+
| +ProduceResults |              0 |    1 |       0 | fof                | fof                        |
| |               +----------------+------+---------+--------------------+----------------------------+
| +Expand(All)    |              0 |    1 |       2 | anon[30], fof -- p | (p)-[:FRIENDS_WITH]->(fof) |
| |               +----------------+------+---------+--------------------+----------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 | p                  | :Person(name)              |
+-----------------+----------------+------+---------+--------------------+----------------------------+

Total database accesses: 4
```
#### 3.7.2.2. Expand Into

시작 및 끝 노드가 이미 발견되면 expand-into를 사용하여 두 노드 간의 모든 연결 관계를 찾습니다.

**Query.**
```Javascript
MATCH (p:Person { name: 'me' })-[:FRIENDS_WITH]->(fof)-->(p)
RETURN fof
```
**Query Plan.**
```
+-----------------+----------------+------+---------+------------------------------+----------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables                    | Other                      |
+-----------------+----------------+------+---------+------------------------------+----------------------------+
| +ProduceResults |              0 |    0 |       0 | fof                          | fof                        |
| |               +----------------+------+---------+------------------------------+----------------------------+
| +Filter         |              0 |    0 |       0 | anon[30], anon[53], fof, p   | NOT(anon[30] == anon[53])  |
| |               +----------------+------+---------+------------------------------+----------------------------+
| +Expand(Into)   |              0 |    0 |       0 | anon[30] -- anon[53], fof, p | (p)-[:FRIENDS_WITH]->(fof) |
| |               +----------------+------+---------+------------------------------+----------------------------+
| +Expand(All)    |              0 |    0 |       1 | anon[53], fof -- p           | (p)<--(fof)                |
| |               +----------------+------+---------+------------------------------+----------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 | p                            | :Person(name)              |
+-----------------+----------------+------+---------+------------------------------+----------------------------+

Total database accesses: 3
```
#### 3.7.2.3. 선택적 전체 확장

선택적으로 주어진 노드에서 트래버스 관계를 확장하고, 행을 생성하기 전에 술어가 평가되는지 확인합니다.

일치하는 관계가 없으면 관계 끝 노드 변수에 널 (null)이 있는 단일 행이 생성됩니다.

**Query.**
```Javascript
MATCH (p:Person)
OPTIONAL MATCH (p)-[works_in:WORKS_IN]->(l)
WHERE works_in.duration > 180
RETURN p, l
```
**Query Plan.**
```
+----------------------+----------------+------+---------+------------------+------------------------------+
| Operator             | Estimated Rows | Rows | DB Hits | Variables        | Other                        |
+----------------------+----------------+------+---------+------------------+------------------------------+
| +ProduceResults      |             14 |   15 |       0 | l, p             | p, l                         |
| |                    +----------------+------+---------+------------------+------------------------------+
| +OptionalExpand(All) |             14 |   15 |      44 | l, works_in -- p | (p)-[works_in:WORKS_IN]->(l) |
| |                    +----------------+------+---------+------------------+------------------------------+
| +NodeByLabelScan     |             14 |   14 |      15 | p                | :Person                      |
+----------------------+----------------+------+---------+------------------+------------------------------+

Total database accesses: 59
```
