### 3.7.4. 행 연산자
이 연산자는 다른 연산자에 의해 생성된 행을 가져와서 다른 행 집합으로 변환합니다.

#### 3.7.4.1. Eager

격리를 위해 이 연산자는 후속 작업에 영향을 주는 작업이 실행을 계속하기 전에 전체 데이터 집합에 대해 완전히 실행되도록 합니다. 그렇지 않으면 방금 만든 루프를 반복하여 데이터를 다시 일치시킬 수 있습니다. Eager 연산자는 데이터를 가져오거나 그래프 구조를 이전 할 때 높은 메모리 사용을 유발할 수 있습니다. 이 경우 작업을 간단한 단계로 나눕니다. 노드와 관계를 별도로 가져올 수 있습니다. 또는 갱신할 레코드를 리턴하고 나중에 갱신 명령문을 실행하십시오.

**Query.**
```Javascript
MATCH (a)-[r]-(b)
DELETE r,a,b
MERGE ()
```
**Query Plan.**
```
+-------------------------+----------------+------+---------+---------------------+--------------+
| Operator                | Estimated Rows | Rows | DB Hits | Variables           | Other        |
+-------------------------+----------------+------+---------+---------------------+--------------+
| +ProduceResults         |              1 |    0 |       0 |                     |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +EmptyResult            |                |    0 |       0 |                     |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +Apply                  |              1 |  504 |       0 | a, b, r -- anon[38] |              |
| |\                      +----------------+------+---------+---------------------+--------------+
| | +AntiConditionalApply |              1 |  504 |       0 | anon[38]            |              |
| | |\                    +----------------+------+---------+---------------------+--------------+
| | | +MergeCreateNode    |              1 |    0 |       0 | anon[38]            |              |
| | |                     +----------------+------+---------+---------------------+--------------+
| | +Optional             |             35 |  504 |       0 | anon[38]            |              |
| | |                     +----------------+------+---------+---------------------+--------------+
| | +AllNodesScan         |             35 |  504 |     540 | anon[38]            |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +Eager                  |                |   36 |       0 | a, b, r             |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +Delete(3)              |             36 |   36 |      39 | a, b, r             |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +Eager                  |                |   36 |       0 | a, b, r             |              |
| |                       +----------------+------+---------+---------------------+--------------+
| +Expand(All)            |             36 |   36 |      71 | a, r -- b           | (b)-[r:]-(a) |
| |                       +----------------+------+---------+---------------------+--------------+
| +AllNodesScan           |             35 |   35 |      36 | b                   |              |
+-------------------------+----------------+------+---------+---------------------+--------------+

Total database accesses: 686
```
#### 3.7.4.2. Distinct

들어오는 행 스트림에서 중복행을 제거합니다.

**Query.**
```Javascript
MATCH (l:Location)<-[:WORKS_IN]-(p:Person)
RETURN DISTINCT l
```
**Query Plan.**
```
+------------------+----------------+------+---------+------------------+----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables        | Other                |
+------------------+----------------+------+---------+------------------+----------------------+
| +ProduceResults  |             14 |    6 |       0 | l                | l                    |
| |                +----------------+------+---------+------------------+----------------------+
| +Distinct        |             14 |    6 |       0 | l                | l                    |
| |                +----------------+------+---------+------------------+----------------------+
| +Filter          |             15 |   15 |      15 | anon[19], l, p   | p:Person             |
| |                +----------------+------+---------+------------------+----------------------+
| +Expand(All)     |             15 |   15 |      25 | anon[19], p -- l | (l)<-[:WORKS_IN]-(p) |
| |                +----------------+------+---------+------------------+----------------------+
| +NodeByLabelScan |             10 |   10 |      11 | l                | :Location            |
+------------------+----------------+------+---------+------------------+----------------------+

Total database accesses: 51
```
#### 3.7.4.3. Eager Aggregation

기본 결과를 열심히 로드하고 그룹키를 맵의 키로 사용하여 Hash맵에 저장합니다.

**Query.**
```Javascript
MATCH (l:Location)<-[:WORKS_IN]-(p:Person)
RETURN l.name AS location, collect(p.name) AS people
```
**Query Plan.**
```
+-------------------+----------------+------+---------+----------------------------+----------------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Variables                  | Other                      |
+-------------------+----------------+------+---------+----------------------------+----------------------------+
| +ProduceResults   |              4 |    6 |       0 | location, people           | location, people           |
| |                 +----------------+------+---------+----------------------------+----------------------------+
| +EagerAggregation |              4 |    6 |      15 | people -- location         | location                   |
| |                 +----------------+------+---------+----------------------------+----------------------------+
| +Projection       |             15 |   15 |      15 | location -- anon[19], l, p | {location : l.name, p : p} |
| |                 +----------------+------+---------+----------------------------+----------------------------+
| +Filter           |             15 |   15 |      15 | anon[19], l, p             | p:Person                   |
| |                 +----------------+------+---------+----------------------------+----------------------------+
| +Expand(All)      |             15 |   15 |      25 | anon[19], p -- l           | (l)<-[:WORKS_IN]-(p)       |
| |                 +----------------+------+---------+----------------------------+----------------------------+
| +NodeByLabelScan  |             10 |   10 |      11 | l                          | :Location                  |
+-------------------+----------------+------+---------+----------------------------+----------------------------+

Total database accesses: 81
```
#### 3.7.4.4. 카운트 저장소에서의 노드 수

카운트 저장소를 사용하여 노드 수에 대한 질문에 답하세요. 이는 실제로 계산하여 동일한 결과를 얻는 열성적인 집계보다 훨씬 빠릅니다. 그러나 카운트 저장소는 제한된 범위의 조합만 저장하므로 보다 복잡한 쿼리에 열성적인 집계가 계속 사용됩니다. 예를 들어 레이블을 하나 이상으로 가진 노드를 제외하고 모든 노드와 하나의 레이블이 있는 노드의 개수를 얻을 수 있습니다.

**Query.**
```Javascript
MATCH (p:Person)
RETURN count(p) AS people
```
**Query Plan.**
```
+--------------------------+----------------+------+---------+-----------+------------------------------+
| Operator                 | Estimated Rows | Rows | DB Hits | Variables | Other                        |
+--------------------------+----------------+------+---------+-----------+------------------------------+
| +ProduceResults          |              4 |    1 |       0 | people    | people                       |
| |                        +----------------+------+---------+-----------+------------------------------+
| +NodeCountFromCountStore |              4 |    1 |       0 | people    | count( (:Person) ) AS people |
+--------------------------+----------------+------+---------+-----------+------------------------------+

Total database accesses: 0
```
#### 3.7.4.5. 카운트 저장소에서의 관계 수

카운트 스토어를 사용하여 관계 수에 대한 질문에 답하세요. 이는 실제로 계산하여 동일한 결과를 얻는 열성적인 집계보다 훨씬 빠릅니다. 그러나 카운트 저장소는 제한된 범위의 조합만 저장하 므로보다 복잡한 쿼리에 열성적인 집계가 계속 사용됩니다. 예를 들어, 양 끝 노드의 레이블이 있는 관계를 제외하고, 모든 관계, 유형과의 관계, 한쪽 끝에 레이블이 있는 관계는 개수를 얻을 수 있습니다.

**Query.**
```Javascript
MATCH (p:Person)-[r:WORKS_IN]->()
RETURN count(r) AS jobs
```
**Query Plan.**
```
+----------------------------------+----------------+------+---------+-----------+--------------------------------------------+
| Operator                         | Estimated Rows | Rows | DB Hits | Variables | Other                                      |
+----------------------------------+----------------+------+---------+-----------+--------------------------------------------+
| +ProduceResults                  |              4 |    1 |       0 | jobs      | jobs                                       |
| |                                +----------------+------+---------+-----------+--------------------------------------------+
| +RelationshipCountFromCountStore |              4 |    1 |       1 | jobs      | count( (:Person)-[:WORKS_IN]->() ) AS jobs |
+----------------------------------+----------------+------+---------+-----------+--------------------------------------------+

Total database accesses: 1
```
#### 3.7.4.6. Filter

조건자를 참으로 평가하는 행을 통과하는 하위 연산자에서 나오는 각 행을 필터링합니다.

**Query.**
```Javascript
MATCH (p:Person)
WHERE p.name =~ '^a.*'
RETURN p
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-----------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other                       |
+-----------------+----------------+------+---------+-----------+-----------------------------+
| +ProduceResults |             14 |    0 |       0 | p         | p                           |
| |               +----------------+------+---------+-----------+-----------------------------+
| +Filter         |             14 |    0 |      14 | p         | p.name ~= /{  AUTOSTRING0}/ |
| |               +----------------+------+---------+-----------+-----------------------------+
| +NodeIndexScan  |             14 |   14 |      15 | p         | :Person(name)               |
+-----------------+----------------+------+---------+-----------+-----------------------------+

Total database accesses: 29
```
#### 3.7.4.7. Limit

들어오는 입력에서 첫 번째 'n'행을 반환합니다.

**Query.**
```Javascript
MATCH (p:Person)
RETURN p
LIMIT 3
```
**Query Plan.**
```
+------------------+----------------+------+---------+-----------+------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables | Other      |
+------------------+----------------+------+---------+-----------+------------+
| +ProduceResults  |              3 |    3 |       0 | p         | p          |
| |                +----------------+------+---------+-----------+------------+
| +Limit           |              3 |    3 |       0 | p         | Literal(3) |
| |                +----------------+------+---------+-----------+------------+
| +NodeByLabelScan |             14 |    3 |       4 | p         | :Person    |
+------------------+----------------+------+---------+-----------+------------+

Total database accesses: 4
```
### 3.7.4.8. Projection

입력에서 각 행에 대해 투영은 표현식 세트를 평가하고 표현식 결과로 행을 작성합니다.

**Query.**
```Javascript
RETURN 'hello' AS greeting
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other                        |
+-----------------+----------------+------+---------+-----------+------------------------------+
| +ProduceResults |              1 |    1 |       0 | greeting  | greeting                     |
| |               +----------------+------+---------+-----------+------------------------------+
| +Projection     |              1 |    1 |       0 | greeting  | {greeting : {  AUTOSTRING0}} |
+-----------------+----------------+------+---------+-----------+------------------------------+

Total database accesses: 0
```
#### 3.7.4.9. Skip

수신 행에서 'n'행 건너 뛰기

**Query.**
```Javascript
MATCH (p:Person)
RETURN p
ORDER BY p.id
SKIP 1
```
**Query Plan.**
```
+------------------+----------------+------+---------+----------------------------+---------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                  | Other         |
+------------------+----------------+------+---------+----------------------------+---------------+
| +ProduceResults  |             14 |   13 |       0 | p                          | p             |
| |                +----------------+------+---------+----------------------------+---------------+
| +Projection      |             14 |   13 |       0 | p -- anon[35], anon[59], p | {p : }        |
| |                +----------------+------+---------+----------------------------+---------------+
| +Skip            |             14 |   13 |       0 | anon[35], anon[59], p      | {  AUTOINT0}  |
| |                +----------------+------+---------+----------------------------+---------------+
| +Sort            |             14 |   14 |       0 | anon[35], anon[59], p      | anon[59]      |
| |                +----------------+------+---------+----------------------------+---------------+
| +Projection      |             14 |   14 |      14 | anon[59] -- anon[35], p    | { : ,  : .id} |
| |                +----------------+------+---------+----------------------------+---------------+
| +Projection      |             14 |   14 |       0 | anon[35] -- p              | { :   p@7}    |
| |                +----------------+------+---------+----------------------------+---------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                          | :Person       |
+------------------+----------------+------+---------+----------------------------+---------------+

Total database accesses: 29
```
#### 3.7.4.10. Sort

제공된 키별로 행을 정렬합니다.

**Query.**
```Javascript
MATCH (p:Person)
RETURN p
ORDER BY p.name
```
**Query Plan.**
```
+------------------+----------------+------+---------+----------------------------+-----------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                  | Other           |
+------------------+----------------+------+---------+----------------------------+-----------------+
| +ProduceResults  |             14 |   14 |       0 | p                          | p               |
| |                +----------------+------+---------+----------------------------+-----------------+
| +Projection      |             14 |   14 |       0 | p -- anon[24], anon[37], p | {p : }          |
| |                +----------------+------+---------+----------------------------+-----------------+
| +Sort            |             14 |   14 |       0 | anon[24], anon[37], p      | anon[37]        |
| |                +----------------+------+---------+----------------------------+-----------------+
| +Projection      |             14 |   14 |      14 | anon[37] -- anon[24], p    | { : ,  : .name} |
| |                +----------------+------+---------+----------------------------+-----------------+
| +Projection      |             14 |   14 |       0 | anon[24] -- p              | { :   p@7}      |
| |                +----------------+------+---------+----------------------------+-----------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                          | :Person         |
+------------------+----------------+------+---------+----------------------------+-----------------+

Total database accesses: 29
```
#### 3.7.4.11. Top

제공된 키별로 정렬된 첫 번째 'n'개의 행을 반환합니다. 실제 연산자는 Top이라고합니다. 전체 입력을 정렬하는 대신 최상위 X 행만 유지합니다.

**Query.**
```Javascript
MATCH (p:Person)
RETURN p
ORDER BY p.name
LIMIT 2
```
**Query Plan.**
```
+------------------+----------------+------+---------+----------------------------+----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables                  | Other                |
+------------------+----------------+------+---------+----------------------------+----------------------+
| +ProduceResults  |              2 |    2 |       0 | p                          | p                    |
| |                +----------------+------+---------+----------------------------+----------------------+
| +Projection      |              2 |    2 |       0 | p -- anon[24], anon[37], p | {p : }               |
| |                +----------------+------+---------+----------------------------+----------------------+
| +Top             |              2 |    2 |       0 | anon[24], anon[37], p      | Literal(2); anon[37] |
| |                +----------------+------+---------+----------------------------+----------------------+
| +Projection      |             14 |   14 |      14 | anon[37] -- anon[24], p    | { : ,  : .name}      |
| |                +----------------+------+---------+----------------------------+----------------------+
| +Projection      |             14 |   14 |       0 | anon[24] -- p              | { :   p@7}           |
| |                +----------------+------+---------+----------------------------+----------------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                          | :Person              |
+------------------+----------------+------+---------+----------------------------+----------------------+

Total database accesses: 29
```
#### 3.7.4.12. Union

Union은 왼쪽 계획의 결과 다음에 올바른 계획의 결과를 연결합니다.

**Query.**
```Javascript
MATCH (p:Location)
RETURN p.name
UNION ALL MATCH (p:Country)
RETURN p.name
```
**Query Plan.**
```
+--------------------+----------------+------+---------+-------------+------------------------+
| Operator           | Estimated Rows | Rows | DB Hits | Variables   | Other                  |
+--------------------+----------------+------+---------+-------------+------------------------+
| +ProduceResults    |             10 |   11 |       0 | p.name      | p.name                 |
| |                  +----------------+------+---------+-------------+------------------------+
| +Union             |             10 |   11 |       0 | p.name      |                        |
| |\                 +----------------+------+---------+-------------+------------------------+
| | +Projection      |              1 |    1 |       1 | p.name -- p | {p.name :   p@83.name} |
| | |                +----------------+------+---------+-------------+------------------------+
| | +NodeByLabelScan |              1 |    1 |       2 | p           | :Country               |
| |                  +----------------+------+---------+-------------+------------------------+
| +Projection        |             10 |   10 |      10 | p.name -- p | {p.name :   p@7.name}  |
| |                  +----------------+------+---------+-------------+------------------------+
| +NodeByLabelScan   |             10 |   10 |      11 | p           | :Location              |
+--------------------+----------------+------+---------+-------------+------------------------+

Total database accesses: 24
```
#### 3.7.4.13. Unwind

값 목록을 가져와서 목록의 항목 당 하나의 행을 반환합니다.

**Query.**
```Javascript
UNWIND range(1, 5) AS value
RETURN value;
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other |
+-----------------+----------------+------+---------+-----------+-------+
| +ProduceResults |             10 |    5 |       0 | value     | value |
| |               +----------------+------+---------+-----------+-------+
| +Unwind         |             10 |    5 |       0 | value     |       |
| |               +----------------+------+---------+-----------+-------+
| +EmptyRow       |              1 |    1 |       0 |           |       |
+-----------------+----------------+------+---------+-----------+-------+

Total database accesses: 0
```
#### 3.7.4.14. Call Procedure

모든 레이블을 이름순으로 반환

**Query.**
```Javascript
CALL db.labels() YIELD label
RETURN *
ORDER BY label
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+----------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other                            |
+-----------------+----------------+------+---------+-----------+----------------------------------+
| +ProduceResults |          10000 |    4 |       0 | label     | label                            |
| |               +----------------+------+---------+-----------+----------------------------------+
| +Sort           |          10000 |    4 |       0 | label     | label                            |
| |               +----------------+------+---------+-----------+----------------------------------+
| +ProcedureCall  |          10000 |    4 |       1 | label     | db.labels() :: (label :: String) |
| |               +----------------+------+---------+-----------+----------------------------------+
| +EmptyRow       |              1 |    1 |       0 |           |                                  |
+-----------------+----------------+------+---------+-----------+----------------------------------+

Total database accesses: 1
```
