### 3.7.1. 출발점 연산자

이 연산자는 그래프의 시작 부분을 찾습니다.

#### 3.7.1.1. 모든 노드 스캔

노드 저장소에서 모든 노드를 읽습니다. 노드를 포함 할 변수가 인수에 표시됩니다. 쿼리에서 이 연산자를 사용하는 경우 중요하지 않은 데이터베이스에서 성능 문제가 발생할 가능성이 큽니다.

**Query.**
```Javascript
MATCH (n)
RETURN n
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other |
+-----------------+----------------+------+---------+-----------+-------+
| +ProduceResults |             35 |   35 |       0 | n         | n     |
| |               +----------------+------+---------+-----------+-------+
| +AllNodesScan   |             35 |   35 |      36 | n         |       |
+-----------------+----------------+------+---------+-----------+-------+

Total database accesses: 36
```
#### 3.7.1.2. ID 탐색의 방향이 있는 관계

관계 저장소에서 ID별로 하나 이상의 관계를 읽습니다. 관계와 노드를 양쪽에서 생성합니다.

**Query.**
```Javascript
MATCH (n1)-[r]->()
WHERE id(r)= 0
RETURN r, n1
```
**Query Plan.**
```
+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+
| Operator                          | Estimated Rows | Rows | DB Hits | Variables       | Other                                      |
+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+
| +ProduceResults                   |              1 |    1 |       0 | n1, r           | r, n1                                      |
| |                                 +----------------+------+---------+-----------------+--------------------------------------------+
| +DirectedRelationshipByIdSeekPipe |              1 |    1 |       1 | anon[17], n1, r | EntityByIdRhs(SingleSeekArg({  AUTOINT0})) |
+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+

Total database accesses: 1
```
#### 3.7.1.3. ID 탐색을 통한 노드

노드 저장소에서 하나 이상의 노드를 ID별로 읽습니다.

**Query.**
```Javascript
MATCH (n)
WHERE id(n)= 0
RETURN n
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other |
+-----------------+----------------+------+---------+-----------+-------+
| +ProduceResults |              1 |    1 |       0 | n         | n     |
| |               +----------------+------+---------+-----------+-------+
| +NodeByIdSeek   |              1 |    1 |       1 | n         |       |
+-----------------+----------------+------+---------+-----------+-------+

Total database accesses: 1
```
#### 3.7.1.4. 레이블 스캔에 의한 노드

레이블 인덱스를 사용하여 노드 레이블 인덱스에서 특정 레이블이 있는 모든 노드를 가져옵니다.

**Query.**
```Javascript
MATCH (person:Person)
RETURN person
```
**Query Plan.**
```
+------------------+----------------+------+---------+-----------+---------+
| Operator         | Estimated Rows | Rows | DB Hits | Variables | Other   |
+------------------+----------------+------+---------+-----------+---------+
| +ProduceResults  |             14 |   14 |       0 | person    | person  |
| |                +----------------+------+---------+-----------+---------+
| +NodeByLabelScan |             14 |   14 |      15 | person    | :Person |
+------------------+----------------+------+---------+-----------+---------+

Total database accesses: 15
```
#### 3.7.1.5. 노드 인덱스 탐색(Node index seek)

인덱스 탐색을 사용하는 노드를 찾습니다. 사용된 노드 변수와 인덱스는 연산자의 인수에 표시됩니다. 인덱스가 고유 인덱스인 경우, 연산자는 대신 NodeUniqueIndexSeek라고합니다.

**Query.**
```Javascript
MATCH (location:Location { name: 'Malmo' })
RETURN location
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other           |
+-----------------+----------------+------+---------+-----------+-----------------+
| +ProduceResults |              1 |    1 |       0 | location  | location        |
| |               +----------------+------+---------+-----------+-----------------+
| +NodeIndexSeek  |              1 |    1 |       2 | location  | :Location(name) |
+-----------------+----------------+------+---------+-----------+-----------------+

Total database accesses: 2
```
#### 3.7.1.6. 노드 인덱스 범위 탐색(Node index range seek)

속성의 값이 주어진 접두사 문자열과 일치하는 인덱스 찾기를 사용하여 노드를 찾습니다. 이 연산자는 STARTS WITH 및 <,>, ⇐ 및> =와 같은 비교에 사용할 수 있습니다.

**Query.**
```Javascript
MATCH (l:Location)
WHERE l.name STARTS WITH 'Lon'
RETURN l
```
**Query Plan.**
```
+-----------------------+----------------+------+---------+-----------+---------------------------------------------+
| Operator              | Estimated Rows | Rows | DB Hits | Variables | Other                                       |
+-----------------------+----------------+------+---------+-----------+---------------------------------------------+
| +ProduceResults       |             26 |    1 |       0 | l         | l                                           |
| |                     +----------------+------+---------+-----------+---------------------------------------------+
| +NodeIndexSeekByRange |             26 |    1 |       2 | l         | :Location(name STARTS WITH {  AUTOSTRING0}) |
+-----------------------+----------------+------+---------+-----------+---------------------------------------------+

Total database accesses: 2
```
#### 3.7.1.7. 스캔을 포함한 노드 인덱스(Node index contains scan)

인덱스는 특정 문자열을 포함하는 항목의 모든 인덱스에 저장된 값을 검색하고 검사를 통과 포함한다. 모든 항목을 검사해야하지만 레이블 스캔과 속성 저장소 필터에 필요한 간접 검색보다 빠르기 때문에 인덱스 검색보다 느립니다.

**Query.**
```Javascript
MATCH (l:Location)
WHERE l.name CONTAINS 'al'
RETURN l
```
**Query Plan.**
```
+------------------------+----------------+------+---------+-----------+----------------------------------+
| Operator               | Estimated Rows | Rows | DB Hits | Variables | Other                            |
+------------------------+----------------+------+---------+-----------+----------------------------------+
| +ProduceResults        |             10 |    2 |       0 | l         | l                                |
| |                      +----------------+------+---------+-----------+----------------------------------+
| +NodeIndexContainsScan |             10 |    2 |       3 | l         | :Location(name); {  AUTOSTRING0} |
+------------------------+----------------+------+---------+-----------+----------------------------------+

Total database accesses: 3
```
#### 3.7.1.8. 노드 인덱스 스캔

인덱스 스캔은 인덱스에 저장된 모든 값을 거치며 지정된 속성 (예 : exists (n.prop))을 갖는 특정 레이블이 있는 모든 노드를 찾는 데 사용할 수 있습니다.

**Query.**
```Javascript
MATCH (l:Location)
WHERE exists(l.name)
RETURN l
```
**Query Plan.**
```
+-----------------+----------------+------+---------+-----------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Variables | Other           |
+-----------------+----------------+------+---------+-----------+-----------------+
| +ProduceResults |             10 |   10 |       0 | l         | l               |
| |               +----------------+------+---------+-----------+-----------------+
| +NodeIndexScan  |             10 |   10 |      11 | l         | :Location(name) |
+-----------------+----------------+------+---------+-----------+-----------------+

Total database accesses: 11
```
#### 3.7.1.9. ID 탐색의 방향이 없는 관계

관계 저장소에서 ID별로 하나 이상의 관계를 읽습니다. 각 관계에 대해 시작과 끝 노드가 다르게 배열된 두 개의 행이 생성됩니다.

**Query.**
```Javascript
MATCH (n1)-[r]-()
WHERE id(r)= 1
RETURN r, n1
```
**Query Plan.**
```
+---------------------------------+----------------+------+---------+-----------------+-------+
| Operator                        | Estimated Rows | Rows | DB Hits | Variables       | Other |
+---------------------------------+----------------+------+---------+-----------------+-------+
| +ProduceResults                 |              1 |    2 |       0 | n1, r           | r, n1 |
| |                               +----------------+------+---------+-----------------+-------+
| +UndirectedRelationshipByIdSeek |              1 |    2 |       1 | anon[16], n1, r |       |
+---------------------------------+----------------+------+---------+-----------------+-------+

Total database accesses: 1
```
